src/cf/InformationRegisters/ТТС_ОтметкиОПроверкеЖурналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТТС_ОтметкиОПроверкеЖурналов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СЗамечаниями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнутреннийДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТТС_ОтметкиОПроверкеЖурналов/Ext/ManagerModule.bsl
Функция ЕстьОтметкаОПроверке(Документ, Роль) Экспорт
	ЗаписьОтметкиОПроверке = РегистрыСведений.ТТС_ОтметкиОПроверкеЖурналов.СоздатьМенеджерЗаписи();
	ЗаписьОтметкиОПроверке.ВнутреннийДокумент = Документ;
	ЗаписьОтметкиОПроверке.РольИсполнителя = Роль;
	ЗаписьОтметкиОПроверке.Прочитать();
	
	Возврат ЗаписьОтметкиОПроверке.Выбран();
КонецФункции

Функция ПолучитьОтметкиОПроверке(Документ) Экспорт
	НаборОтметкиОПроверке = РегистрыСведений.ТТС_ОтметкиОПроверкеЖурналов.СоздатьНаборЗаписей();
	НаборОтметкиОПроверке.Отбор.ВнутреннийДокумент.Установить(Документ);
	НаборОтметкиОПроверке.Прочитать();
	
	ОтметкиОПроверке = НаборОтметкиОПроверке.Выгрузить();
	Возврат ОтметкиОПроверке;
КонецФункции

Процедура ЗаписатьОтметкуОПроверке(ДанныеПроверки) Экспорт
	ЗаписьОтметкиОПроверке = РегистрыСведений.ТТС_ОтметкиОПроверкеЖурналов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьОтметкиОПроверке,ДанныеПроверки);
	ЗаписьОтметкиОПроверке.Записать();
КонецПроцедуры
